import matplotlib.pyplot as plt
from pylab import *                                 #支持中文
mpl.rcParams['font.sans-serif'] = ['SimHei']

#82个点,完整
#aqn_amp=[1.365, 1.36, 1.305, 1.39, 1.235, 1.14, 1.065, 0.915, 1.13, 0.96, 1.01, 1.245, 1.265, 1.16, 1.07, 1.485, 1.67, 1.73, 1.43, 1.375, 1.62, 1.89, 1.735, 1.525, 1.415, 1.35, 1.655, 1.595, 1.45, 1.34, 1.475, 1.615, 1.55, 1.29, 1.755, 1.605, 2.005, 1.755, 1.45, 1.535, 1.355, 1.645, 1.79, 1.67, 1.8, 1.775, 1.53, 1.7, 1.495, 1.17, 1.27, 1.145, 0.815, 0.795, 0.88, 0.985, 1.025, 1.105, 1.175, 0.775, 1.425, 2.22, 2.79, 2.8, 2.035, 1.725, 1.54, 1.295, 1.605, 1.83, 2.18, 1.605, 2.095, 2.075, 1.52, 1.31, 0.995, 1.03, 1.255, 1.27, 1.43, 1.405]
aqn_amp=[1.365, 1.36, 1.305, 1.39, 1.235, 1.14, 1.065, 0.915, 1.13, 0.96, 1.01, 1.245, 1.265, 1.16, 1.07, 1.485, 1.67, 1.73, 1.43, 1.375, 1.62]

#x = range(len(aqn_amp))
x = range(0,6300,300)
plt.figure(figsize=(15, 5))
#plt.plot(x, y, 'ro-')
#plt.plot(x, y1, 'bo-')
#pl.xlim(-1, 11)  # 限定横轴的范围
#pl.ylim(-1, 110)  # 限定纵轴的范围
plt.plot(x,aqn_amp, marker='p', mec='r', mfc='w',label=u'心电电压幅值')

plt.legend()  # 让图例生效
plt.xticks(fontsize=15) #设置坐标轴字体
plt.yticks(fontsize=15)
plt.xticks( rotation=45)
plt.margins(0)
plt.subplots_adjust(bottom=0.15)
plt.xlabel(u"时间(s)") #X轴标签
plt.ylabel("电压") #Y轴标签
plt.title("心电电压幅值") #标题


plt.show()